Revit 2022 API
TransmissionData.UserData Property
 A string which users can store notes in.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2012
Syntax
C#
public string UserData { get; set; }
Visual Basic
Public Property UserData As String
	Get
	Set
Visual C++
public:
property String^ UserData {
	String^ get ();
	void set (String^ value);
}
Remarks
 Revit stores the systems analysis report path in this data if any report exists in the document, so eTransmit can include all external reports.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
TransmissionData Class
Autodesk.Revit.DB Namespace